; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p4---int100n150-m25---int100c110---s21---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 - fuellevel
)

(:init
(sum level0 level8 level8)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level20 level20)
(sum level0 level25 level25)
(sum level1 level8 level9)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level20 level21)
(sum level1 level25 level26)
(sum level2 level8 level10)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level20 level22)
(sum level2 level25 level27)
(sum level3 level8 level11)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level20 level23)
(sum level3 level25 level28)
(sum level4 level8 level12)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level20 level24)
(sum level4 level25 level29)
(sum level5 level8 level13)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level20 level25)
(sum level5 level25 level30)
(sum level6 level8 level14)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level20 level26)
(sum level6 level25 level31)
(sum level7 level8 level15)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level20 level27)
(sum level7 level25 level32)
(sum level8 level8 level16)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level20 level28)
(sum level8 level25 level33)
(sum level9 level8 level17)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level20 level29)
(sum level9 level25 level34)
(sum level10 level8 level18)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level20 level30)
(sum level10 level25 level35)
(sum level11 level8 level19)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level20 level31)
(sum level11 level25 level36)
(sum level12 level8 level20)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level20 level32)
(sum level12 level25 level37)
(sum level13 level8 level21)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level20 level33)
(sum level13 level25 level38)
(sum level14 level8 level22)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level20 level34)
(sum level14 level25 level39)
(sum level15 level8 level23)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level20 level35)
(sum level15 level25 level40)
(sum level16 level8 level24)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level20 level36)
(sum level16 level25 level41)
(sum level17 level8 level25)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level20 level37)
(sum level17 level25 level42)
(sum level18 level8 level26)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level20 level38)
(sum level18 level25 level43)
(sum level19 level8 level27)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level20 level39)
(sum level19 level25 level44)
(sum level20 level8 level28)
(sum level20 level12 level32)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level20 level40)
(sum level20 level25 level45)
(sum level21 level8 level29)
(sum level21 level12 level33)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level20 level41)
(sum level21 level25 level46)
(sum level22 level8 level30)
(sum level22 level12 level34)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level20 level42)
(sum level22 level25 level47)
(sum level23 level8 level31)
(sum level23 level12 level35)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level20 level43)
(sum level23 level25 level48)
(sum level24 level8 level32)
(sum level24 level12 level36)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level20 level44)
(sum level24 level25 level49)
(sum level25 level8 level33)
(sum level25 level12 level37)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level20 level45)
(sum level25 level25 level50)
(sum level26 level8 level34)
(sum level26 level12 level38)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level20 level46)
(sum level26 level25 level51)
(sum level27 level8 level35)
(sum level27 level12 level39)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level20 level47)
(sum level27 level25 level52)
(sum level28 level8 level36)
(sum level28 level12 level40)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level20 level48)
(sum level28 level25 level53)
(sum level29 level8 level37)
(sum level29 level12 level41)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level20 level49)
(sum level29 level25 level54)
(sum level30 level8 level38)
(sum level30 level12 level42)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level20 level50)
(sum level30 level25 level55)
(sum level31 level8 level39)
(sum level31 level12 level43)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level20 level51)
(sum level31 level25 level56)
(sum level32 level8 level40)
(sum level32 level12 level44)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level20 level52)
(sum level32 level25 level57)
(sum level33 level8 level41)
(sum level33 level12 level45)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level20 level53)
(sum level33 level25 level58)
(sum level34 level8 level42)
(sum level34 level12 level46)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level20 level54)
(sum level34 level25 level59)
(sum level35 level8 level43)
(sum level35 level12 level47)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level20 level55)
(sum level35 level25 level60)
(sum level36 level8 level44)
(sum level36 level12 level48)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level20 level56)
(sum level36 level25 level61)
(sum level37 level8 level45)
(sum level37 level12 level49)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level20 level57)
(sum level37 level25 level62)
(sum level38 level8 level46)
(sum level38 level12 level50)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level20 level58)
(sum level38 level25 level63)
(sum level39 level8 level47)
(sum level39 level12 level51)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level20 level59)
(sum level39 level25 level64)
(sum level40 level8 level48)
(sum level40 level12 level52)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level20 level60)
(sum level40 level25 level65)
(sum level41 level8 level49)
(sum level41 level12 level53)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level20 level61)
(sum level41 level25 level66)
(sum level42 level8 level50)
(sum level42 level12 level54)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level20 level62)
(sum level42 level25 level67)
(sum level43 level8 level51)
(sum level43 level12 level55)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level20 level63)
(sum level43 level25 level68)
(sum level44 level8 level52)
(sum level44 level12 level56)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level20 level64)
(sum level45 level8 level53)
(sum level45 level12 level57)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level20 level65)
(sum level46 level8 level54)
(sum level46 level12 level58)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level20 level66)
(sum level47 level8 level55)
(sum level47 level12 level59)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level20 level67)
(sum level48 level8 level56)
(sum level48 level12 level60)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level20 level68)
(sum level49 level8 level57)
(sum level49 level12 level61)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level50 level8 level58)
(sum level50 level12 level62)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level51 level8 level59)
(sum level51 level12 level63)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level52 level8 level60)
(sum level52 level12 level64)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level53 level8 level61)
(sum level53 level12 level65)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level54 level8 level62)
(sum level54 level12 level66)
(sum level54 level14 level68)
(sum level55 level8 level63)
(sum level55 level12 level67)
(sum level56 level8 level64)
(sum level56 level12 level68)
(sum level57 level8 level65)
(sum level58 level8 level66)
(sum level59 level8 level67)
(sum level60 level8 level68)

(connected l0 l1)
(fuelcost level8 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l0 l3)
(fuelcost level14 l0 l3)
(connected l1 l0)
(fuelcost level8 l1 l0)
(connected l1 l2)
(fuelcost level20 l1 l2)
(connected l1 l3)
(fuelcost level12 l1 l3)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level20 l2 l1)
(connected l2 l3)
(fuelcost level15 l2 l3)
(connected l3 l0)
(fuelcost level14 l3 l0)
(connected l3 l1)
(fuelcost level12 l3 l1)
(connected l3 l2)
(fuelcost level15 l3 l2)

(at t0 l1)
(fuel t0 level68)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l3)
(at p3 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l0 level60 level8 level68)
   deleted: (at t0 l1) (fuel t0 level68)
   added: (at t0 l0) (fuel t0 level60)
   goals met: 0 of 4
2. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 4
3. (drive t0 l0 l3 level46 level14 level60)
   deleted: (at t0 l0) (fuel t0 level60)
   added: (at t0 l3) (fuel t0 level46)
   goals met: 0 of 4
4. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 4
5. (drive t0 l3 l2 level31 level15 level46)
   deleted: (at t0 l3) (fuel t0 level46)
   added: (at t0 l2) (fuel t0 level31)
   goals met: 0 of 4
6. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 4
7. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 4
8. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 4
9. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 4
10. (drive t0 l2 l0 level6 level25 level31)
   deleted: (at t0 l2) (fuel t0 level31)
   added: (at t0 l0) (fuel t0 level6)
   goals met: 2 of 4
11. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 3 of 4
12. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 4 of 4
